2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/request_template-BevragingLeveringenzoekPersoon.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>${DataSource Values#Header_EEE1}</soapenv:Header>
   <soapenv:Body>
      <brp:ALG_ZoekPersoon_V xmlns:brp="http://www.bzk.nl/brp/brp0200">
         <brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
            <brp:zendendePartij>${DataSource Values#zendendePartij_zsA1}</brp:zendendePartij>
            <brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsA1}</brp:zendendeSysteem>
            <brp:referentienummer>${DataSource Values#referentienummer_sAB1}</brp:referentienummer>
            <brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="${DataSource Values#com_id.parameters1}">
            <brp:abonnementNaam>${DataSource Values#abonnementNaam_pAB1}</brp:abonnementNaam>
         </brp:parameters>
         <brp:vraag
                    brp:communicatieID="${DataSource Values#com_id.vraag1}"
                    brp:objecttype="Vraag">
            <brp:zoekcriteria brp:communicatieID="${DataSource Values#com_id.zoekcriteria1}">
               <brp:burgerservicenummer>${DataSource Values#burgerservicenummer_zvA1}</brp:burgerservicenummer>
               <brp:administratienummer>${DataSource Values#administratienummer_zvA1}</brp:administratienummer>
               <brp:geslachtsnaamstam>${DataSource Values#geslachtsnaamstam_zvA1}</brp:geslachtsnaamstam>
               <brp:geboortedatum>${DataSource Values#geboortedatum_zvA1}</brp:geboortedatum>
               <brp:huisnummer>${DataSource Values#huisnummer_zvA1}</brp:huisnummer>
               <brp:huisletter>${DataSource Values#huisletter_zvA1}</brp:huisletter>
               <brp:huisnummertoevoeging>${DataSource Values#huisnummertoevoeging_zvA1}</brp:huisnummertoevoeging>
               <brp:postcode>${DataSource Values#postcode_zvA1}</brp:postcode>
            </brp:zoekcriteria>
         </brp:vraag>
      </brp:ALG_ZoekPersoon_V>
   </soapenv:Body>
</soapenv:Envelope>
